""" 1. Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр. """

# f_num = float(input('Введите вещественное число:  '))
# f_num = str(f_num)
# sum = 0
# for i in f_num:
#     if i.isdigit() == True:
#         sum = sum + int(i)   
# print(sum)
