""" 2. Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N. """

# 1 способ
# n = int(input('Введите число: '))
# q = 1
# mult = 1
# while q <= n:
#     mult *= q
#     q += 1
#     print(mult, end = ' ')


# 2 способ
# n = int(input('Введите число: '))
# mult = 1
# for i in range(n):
#     i += 1
#     mult *= i
#     print(mult, end = ' ')
