""" 3. Задайте список из n чисел последовательности (1 + 1/n)**n и выведите на экран их сумму. """

# n = int(input('Введите число n: '))
# summ = 0
# result = 0
# for i in range(n + 1):
#     i += 1
#     result = (1 + 1/i) ** i
#     summ += result
# print(summ)
