""" 4. Вы пользуетесь общественным транспортом? Вероятно, вы
расплачивались за проезд и получали билет с номером. Счастливым
билетом называют такой билет с шестизначным номером, где сумма
первых трех цифр равна сумме последних трех. Т.е. билет с номером
385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать
программу, которая проверяет счастливость билета. """

# a, b, c, d, e, f = input('Введите номер билета (6 цифр)  ')
# n1 = int(a) + int(b) + int(c)
# n2 = int(d) + int(e) + int(f)
# if n1 == n2:
#     print ('Счастливый')
# else:
#     print ('Обычный')
